Learning and using pandas

In [66]:
import pandas as pd
import numpy as np

In [67]:
#Create a list of prices for medicines
med_price_list = [45, 34, 56, 78, 90]

In [68]:
#Convert the list into an array
med_price_array = np.array(med_price_list)

In [69]:
#convert list and array into pandas series object
series_list = pd.Series(med_price_list)
series_arr = pd.Series(med_price_array)

In [70]:
#print the series object
print(series_list)
print(series_arr)

0    45
1    34
2    56
3    78
4    90
dtype: int64
0    45
1    34
2    56
3    78
4    90
dtype: int32

Series has automatically got index labels

In [71]:
#Changing the index of a series
med_price_list_labelled = pd.Series(med_price_list, index=["Omeprazole","Azithromycin","Meetfroming",
"Ibuprofen","Cetirizine"])
print(med_price_list_labelled)

Omeprazole      45
Azithromycin    34
Meetfroming     56
Ibuprofen       78
Cetirizine      90
dtype: int64

Perfoming mathematical operations on Pandas Series

In [72]:
#Increment all prices by $2.5
med_price_list_labelled = med_price_list_labelled + 2.5
med_price_list_labelled

Omeprazole      47.5
Azithromycin    36.5
Meetfroming     58.5
Ibuprofen       80.5
Cetirizine      92.5
dtype: float64

In [73]:
#A new price list has been released by vendors for each medicine
new_price_list = [77,56,87,90,21]
new_price_list_labelled = pd.Series(new_price_list, index = ["Omeprazole","Azithromycin","Meetfroming",
"Ibuprofen","Cetirizine"])
new_price_list_labelled

Omeprazole      77
Azithromycin    56
Meetfroming     87
Ibuprofen       90
Cetirizine      21
dtype: int64

In [74]:
#Print difference between new price list and previous price list
print(new_price_list_labelled - med_price_list_labelled)

Omeprazole      29.5
Azithromycin    19.5
Meetfroming     28.5
Ibuprofen        9.5
Cetirizine     -71.5
dtype: float64

Pandas DataFrame is a two-dimensional tabular data structure with labelled axes(rows and columns)

In [75]:
#Creating a pandas dataframe
student = ["Mary","Peter","Susan","Toby","Vishal"]
df1 = pd.DataFrame(student, columns=["Student"])
df1

  Student
0    Mary
1   Peter
2   Susan
3    Toby
4  Vishal

In [76]:
#Creating a Pandas DataFrame using a dictionary
grades = ["B-", "A+", "A-","B+","C"]

df2 = pd.DataFrame({"Student":student, "Grade": grades})
df2

  Student Grade
0    Mary    B-
1   Peter    A+
2   Susan    A-
3    Toby    B+
4  Vishal     C

In [77]:
student[0:3]

['Mary', 'Peter', 'Susan']

Creating a pandas dataframe using series

In [78]:
#Total energy consumption in the US between 2012 - 2018
year = pd.Series(np.arange(2012,2019,1))
energy_consumption = pd.Series([2152, 2196, 2217, 2194, 2172, 2180, 2258])

df3 = pd.DataFrame({"Year":year, "Energy_Consumption(Mtoe)":energy_consumption})
df3

   Year  Energy_Consumption(Mtoe)
0  2012                      2152
1  2013                      2196
2  2014                      2217
3  2015                      2194
4  2016                      2172
5  2017                      2180
6  2018                      2258

Creating a Pandas DataFrame using random values

In [79]:
df4 = pd.DataFrame(np.random.randn(5,2), columns = ["Trial 1", "Trial 2"])
df4

    Trial 1   Trial 2
0  0.623583 -0.551709
1  0.803438  1.215883
2  0.536733 -0.467673
3 -0.675744  0.131955
4  0.128630 -1.008651

In [80]:
s = pd.Series([5,5,5,5], index=[0,1,2,3])
s

0    5
1    5
2    5
3    5
dtype: int64

Accessing series

In [81]:
operators = ["AT&T", "Verizon", "T-Mobile US", "US Cellular"]
revenue = [456.7, 345.6, 213.1, 987.56]

telecom = pd.Series(revenue, index=operators)
telecom

AT&T           456.70
Verizon        345.60
T-Mobile US    213.10
US Cellular    987.56
dtype: float64

In [82]:
telecom["AT&T"]

456.7

In [83]:
telecom[0:3]

AT&T           456.7
Verizon        345.6
T-Mobile US    213.1
dtype: float64

In [84]:
telecom[-2:]

T-Mobile US    213.10
US Cellular    987.56
dtype: float64

In [85]:
telecom[[0,2,3]]

AT&T           456.70
T-Mobile US    213.10
US Cellular    987.56
dtype: float64

In [86]:
telecom

AT&T           456.70
Verizon        345.60
T-Mobile US    213.10
US Cellular    987.56
dtype: float64

In [87]:
telecom["Verizon":]

Verizon        345.60
T-Mobile US    213.10
US Cellular    987.56
dtype: float64

In [88]:
telecom[:"Verizon"]

AT&T       456.7
Verizon    345.6
dtype: float64

In [89]:
telecom[["AT&T","Verizon"]]

AT&T       456.7
Verizon    345.6
dtype: float64

Accessing DataFrames

In [90]:
store_data = pd.DataFrame({
    "CustomerID":["CustID00","CustID01","CustID02","CustID03","CustID05"],
    "location": ["Chicago", "Boston", "Seattle", "San Franscisco", "Austin"],
    "gender": ["M","M","F","M","F"],
    "type": [
        "electronics",
        "Food&Beverages",
        "Food&Beverages",
        "Medicine",
        "Beauty"
    ],
    "Quantity":[1,3,4,2,1],
    "total_bill": [100, 75, 125, 50, 80]
})
store_data

  CustomerID        location gender            type  Quantity  total_bill
0   CustID00         Chicago      M     electronics         1         100
1   CustID01          Boston      M  Food&Beverages         3          75
2   CustID02         Seattle      F  Food&Beverages         4         125
3   CustID03  San Franscisco      M        Medicine         2          50
4   CustID05          Austin      F          Beauty         1          80

In [91]:
store_data[:1]

  CustomerID location gender         type  Quantity  total_bill
0   CustID00  Chicago      M  electronics         1         100

In [92]:
store_data["location"]

0           Chicago
1            Boston
2           Seattle
3    San Franscisco
4            Austin
Name: location, dtype: object

In [93]:
store_data[::2]

  CustomerID location gender            type  Quantity  total_bill
0   CustID00  Chicago      M     electronics         1         100
2   CustID02  Seattle      F  Food&Beverages         4         125
4   CustID05   Austin      F          Beauty         1          80

In [94]:
store_data[:2]

  CustomerID location gender            type  Quantity  total_bill
0   CustID00  Chicago      M     electronics         1         100
1   CustID01   Boston      M  Food&Beverages         3          75

In [95]:
store_data[::-2]

  CustomerID location gender            type  Quantity  total_bill
4   CustID05   Austin      F          Beauty         1          80
2   CustID02  Seattle      F  Food&Beverages         4         125
0   CustID00  Chicago      M     electronics         1         100

In [96]:
store_data.location

0           Chicago
1            Boston
2           Seattle
3    San Franscisco
4            Austin
Name: location, dtype: object

In [97]:
series = pd.Series([420, 380, 390], index = ['day1', 'day2','day3'])

In [98]:
series[0]

420

In [99]:
series[:'day3']

day1    420
day2    380
day3    390
dtype: int64

In [100]:
calorie_data = pd.DataFrame({'day': ['day1', 'day2', 'day3', 'day4', 'day5'],
                            'calories': [450, 300, 345, 520, 600],
                             'duration_min': [30, 25, 29, 39, 48] })

calorie_data

    day  calories  duration_min
0  day1       450            30
1  day2       300            25
2  day3       345            29
3  day4       520            39
4  day5       600            48

In [101]:
calorie_data[:2]

    day  calories  duration_min
0  day1       450            30
1  day2       300            25

In [102]:
calorie_data.calories

0    450
1    300
2    345
3    520
4    600
Name: calories, dtype: int64

In [103]:
calorie_data['calories']

0    450
1    300
2    345
3    520
4    600
Name: calories, dtype: int64

Using loc and iloc

In [104]:
#Access index 1 with loc
store_data.loc[1]

CustomerID          CustID01
location              Boston
gender                     M
type          Food&Beverages
Quantity                   3
total_bill                75
Name: 1, dtype: object

In [105]:
store_data[:1]

  CustomerID location gender         type  Quantity  total_bill
0   CustID00  Chicago      M  electronics         1         100

In [106]:
store_data.loc[[1,4],["location", "type"]]

  location            type
1   Boston  Food&Beverages
4   Austin          Beauty

iloc in Pandas DataFrame is used for integer location-based indexing/selection by position

In [107]:
store_data.iloc[[1, 4], [0, 2]]

  CustomerID gender
1   CustID01      M
4   CustID05      F

In [108]:
print(store_data.loc[4,"type"])

Beauty

In [109]:
store_data.loc[4,"type"] = "Electonics"

In [110]:
store_data

  CustomerID        location gender            type  Quantity  total_bill
0   CustID00         Chicago      M     electronics         1         100
1   CustID01          Boston      M  Food&Beverages         3          75
2   CustID02         Seattle      F  Food&Beverages         4         125
3   CustID03  San Franscisco      M        Medicine         2          50
4   CustID05          Austin      F      Electonics         1          80

In [111]:
store_data.iloc[4,3] = "beauty"

In [112]:
store_data

  CustomerID        location gender            type  Quantity  total_bill
0   CustID00         Chicago      M     electronics         1         100
1   CustID01          Boston      M  Food&Beverages         3          75
2   CustID02         Seattle      F  Food&Beverages         4         125
3   CustID03  San Franscisco      M        Medicine         2          50
4   CustID05          Austin      F          beauty         1          80

In [113]:
calorie_data.loc[0]

day             day1
calories         450
duration_min      30
Name: 0, dtype: object

In [114]:
calorie_data

    day  calories  duration_min
0  day1       450            30
1  day2       300            25
2  day3       345            29
3  day4       520            39
4  day5       600            48

In [115]:
calorie_data.loc[[1,2],['calories']]

   calories
1       300
2       345

In [116]:
calorie_data.iloc[[1,2],[1]]

   calories
1       300
2       345

In [117]:
store_data

  CustomerID        location gender            type  Quantity  total_bill
0   CustID00         Chicago      M     electronics         1         100
1   CustID01          Boston      M  Food&Beverages         3          75
2   CustID02         Seattle      F  Food&Beverages         4         125
3   CustID03  San Franscisco      M        Medicine         2          50
4   CustID05          Austin      F          beauty         1          80

In [118]:
store_data['Quantity'] > 1

0    False
1     True
2     True
3     True
4    False
Name: Quantity, dtype: bool

In [119]:
store_data[store_data['Quantity']>1]

  CustomerID        location gender            type  Quantity  total_bill
1   CustID01          Boston      M  Food&Beverages         3          75
2   CustID02         Seattle      F  Food&Beverages         4         125
3   CustID03  San Franscisco      M        Medicine         2          50

In [120]:
store_data.loc[store_data['Quantity']>1]

  CustomerID        location gender            type  Quantity  total_bill
1   CustID01          Boston      M  Food&Beverages         3          75
2   CustID02         Seattle      F  Food&Beverages         4         125
3   CustID03  San Franscisco      M        Medicine         2          50

In [121]:
store_data['rating'] = [1, 2, 3, 4, 5]

In [122]:
store_data

,CustomerID,location,gender,type,Quantity,total_bill,rating
0,CustID00,Chicago,M,electronics,1,100,1
1,CustID01,Boston,M,Food&Beverages,3,75,2
2,CustID02,Seattle,F,Food&Beverages,4,125,3
3,CustID03,San Franscisco,M,Medicine,2,50,4
4,CustID05,Austin,F,beauty,1,80,5

In [123]:
store_data.drop('CustomerID', axis=1)

         location gender            type  Quantity  total_bill  rating
0         Chicago      M     electronics         1         100       1
1          Boston      M  Food&Beverages         3          75       2
2         Seattle      F  Food&Beverages         4         125       3
3  San Franscisco      M        Medicine         2          50       4
4          Austin      F          beauty         1          80       5

In [124]:
store_data

,CustomerID,location,gender,type,Quantity,total_bill,rating
0,CustID00,Chicago,M,electronics,1,100,1
1,CustID01,Boston,M,Food&Beverages,3,75,2
2,CustID02,Seattle,F,Food&Beverages,4,125,3
3,CustID03,San Franscisco,M,Medicine,2,50,4
4,CustID05,Austin,F,beauty,1,80,5

In [125]:
store_data.drop('CustomerID', axis=1, inplace=True)

In [126]:
store_data

         location gender            type  Quantity  total_bill  rating
0         Chicago      M     electronics         1         100       1
1          Boston      M  Food&Beverages         3          75       2
2         Seattle      F  Food&Beverages         4         125       3
3  San Franscisco      M        Medicine         2          50       4
4          Austin      F          beauty         1          80       5